In [2]:
import numpy as np
import pandas as pd

In [14]:
df = pd.DataFrame({'column2': np.random.choice(['A', 'B'], size=10)})
df1['column1'] = ''
df1.loc[df['column2'] == 'A', 'column1'] = 'Apple'
df1.loc[df['column2'] == 'B', 'column1'] = 'Ball'

In [16]:
df2 = pd.DataFrame({'X': range(10)})
df2['column1'] = df1['column1']
df2

   X column1
0  0    Ball
1  1    Ball
2  2    Ball
3  3   Apple
4  4    Ball
5  5    Ball
6  6    Ball
7  7    Ball
8  8   Apple
9  9   Apple

In [5]:
new_labels = pd.MultiIndex.from_frame(df.iloc[:2].T.astype(str), names=['Year', 'Sales'])
df1 = df.set_axis(new_labels, axis=1).iloc[2:]
df1 = df1.stack()
df1 = df1.reset_index()
df1

Year  level_0         Sales 2015 2016   date
0           2         Dates  NaN  NaN  10/12
1           2  Dollar Sales    3    1    NaN
2           2    Unit Sales    4    2    NaN
3           3         Dates  NaN  NaN  06/08
4           3  Dollar Sales    7    5    NaN
5           3    Unit Sales    8    6    NaN